'use strict';
//const express         = require('express');
//const app             = express();
//const path            = require('path');
//const bodyParser      = require('body-parser');
//const urlShortener    = require('node-url-shortener');
const TelegramBot     = require('node-telegram-bot-api');

//const zaprosFootball      = require('./requestAllFootball.js');

const token             = '789599718:AAFr_w13A1QFIVberTIMcphCWSHBD8vWzMc';
const chatIdChanelNews  = '-1001382295148';
//const counter             = 0;
const bufer               = [];
const chatIdChanelModer2  = '594504840';    // К

const botTelegram = new TelegramBot(token, { polling: true });
botTelegram.onText(/(.+)/, async (msg) => {
  const chatId          = msg.chat.id;
  botTelegram.sendMessage(chatId, 'sss  ');
});


const arr = [{ immage: 'https://football24.ua/resources/photos/news/1200x675_DIR/202104/660699.jpg?202104095156', caption: [
  'Арсенал в рамках першого півфінального поєдинку Ліги Європи зазнав неприємної поразки від Вільяреала, але зберіг хороші шанси на вихід у фінал.\n' +
    'Історія останніх виходів Арсенала у фінал єврокубків сильно пов\'язана із Вільяреалом. У 2006 році "каноніри" переграли "жовту субмарину" в півфіналі Ліги чемпіонів, а у 2019-му вони зіграли у фіналі Ліги Європи – наставником лондонців тоді був Унаї Емері, який нині очолює левантійців. Баск має вже три тріумфи у цьому турнірі, а нині у нього була особлива мотивація – необхідно було помститися британцям. На Альбіоні з Емері й досі насміхаються, а провал в АПЛ призвів до обвалу міжнародного авторитету легендарного коуча.\n' +
    'У "гуннерів" мотивація на перемогу була простішою. Через чемпіонат Англії підопічні Мікеля Артети вже навряд чи зможуть прорватись у єврокубки на наступний сезон, тож у Арсенала залишався єдиний шлях засвітитись у Європі – виграти ЛЄ та автоматично пройти у Лігу чемпіонів.\n' +
    'Вільяреал з перших хвилин захопив ініціативу у зустрічі. Лондонці навіть',
  " не могли зачепитись за м'яч на чужій половині, обмежуючись не дуже якісним пресингом, а левантійці вже на 5-й хвилині відкрили рахунок! Гол створив Чуквуезе, який змістився з правого флангу на край штрафного й переграв одразу двох захисників – щоправда, він дещо відпустив м'яч від себе, але цим скористався Трігерос. Мануель завдав потужного удару в дальній кут – 1:0!\n" +
    '\n' +
    'Десь до 15-ї хвилини господарі продовжували домінувати, організовуючи хороші атаки, але поступово Арсеналу вдалося збити темп. Матч вирівнявся, однак створити бодай щось попереду лондонцям все так же не вдавалося. Аж на 25-й хвилині вони розродилися першим ударом по воротах – це Сака завершив непоганий контрвипад, пробивши з правого кута карного майданчика. Вийшло занадто неточно. На 27-й ще одну перспективну атаку запоров Парті, який вистрілив з дистанції кудись у небо. Ось і вся гострота з боку гостей.\n' +
    'Вільяреал покарав суперника за пасивність на 29-й хвилині з кутового, який заробив Педраса. Парехо виконав подачу, а Морено, високо вистрибнувши,',
  " скинув м'яч на дальню стійку – там опинився Альбіоль! Рауль розстріляв ворота з метру. 2:0! Щоправда, вже на 33-й хвилині Арсенал міг скоротити відставання внаслідок вривання Пепе на лівий край штрафного та фолу з боку Фойта у штрафному. Арбітр свиснув пенальті, але після перегляду відоповтору скасував своє рішення. Ніколя перед вриванням підіграв собі рукою.\n" +
    '\n' +
    `Це була остання атакувальна дія Арсенала у першому таймі, а от Вільяреал і не думав зупинятись. "Жовта субмарина" могла закрити гру практично одразу після другого голу внаслідок скидки Трігероса під удар Морено метрів з 18-ти, але Жерар вистрілив повз ближню стійку. На 42-й хвилині Морено отримав розрізний пас від Фойта й обіграв Лєно, але пробити у порожні ворота йому завадила втрата рівноваги. На 44-й же Фойт заробив стандарт, з якого прямий удар у ближню дев'ятку завдав Алькасер – Лєно впорався з цим ударом.\n` +
    'Відпочивати команди відправились за комфортної переваги Вільяреала в рахунку. На початку другого тайму, однак, "жовта субмарина" віддала',
  ' ініціативу, витягуючи Арсенал на свою половину в надії на контратаки. Лондонці дійсно притиснули суперника на перших хвилинах, але нічого цікавішого за заблокований удар Пепе з меж штрафного та серію подач створити так і не вдалося – а на 57-й хвилині команда ще й меншості залишилась! Це Себальйос отримав другу жовту картку, наступивши на ногу Парехо.\n' +
    '\n' +
    `Після цього Вільяреал повернувся до гри першим номером, що вилилось у справжній розрив оборони "канонірів". Так, на 61-й хвилині Чуквуезе отримав передачу від Трігероса на правому краю штрафного, ефектно хитнув Марі й потужно пробив у дальній кут – Лєно парирував! На 66-й Морено відкрився між Холдінгом і Марі, отримав розрізний пас у карний майданчик і потужно вистрілив у ліву дев'ятку, однак і тут Лєно врятував! Ще за три хвилини Чуквуезе накрутив захисників і викотив м'яч під удар Морено метрів з 15-ти, але Жерар спрямував м'яч по центру. Лєно виручив.\n` +
    'Покарання за марнотратство прилетіло вже на 72-й хвилині – Сака увірвався на правий край штрафного й впав у',
  ' оточенні трьох захисників, а рефері свиснув пенальті! На Букайо, ніби-то, сфолив Трігерос, хоча відеоповтори не дали чіткою відповіді на це питання. Так чи інакше, Пепе з "позначки" не схибив. 2:1!\n' +
    '\n' +
    'На цьому проблеми Вільяреала не завершились. На 79-й хвилині в центрі поля стався стик між Капу та Сака – у Етьєна поїхала нога, внаслідок чого він скосив Букайо прямим ударом ногу. Арбітр показав хавбеку левантійців жовту картку, однак вона стала другою для Капу! Склади зрівнялися, а винуватця довелося виносити з поля на ношах.\n' +
    "Крім очевидних мінусів, ця подія сильно збила ритм гри, адже пауза у матчі виявилась тривалою. Обидва тренери намагалися розігнати поєдинок замінами – Унаї Емері випустив Альберто Морено та Мойзе Гомеса, а Мікель Артета наважився кинути у бій Обамеянга. Вільяреал провів ендшпіль зустрічі активніше, але жодного моменту господарі так і не створили – Арсенал же міг вирвати нічию на 90+3-й хвилині внаслідок розрізного пасу Парті на Обамеянга. П'єр-Емерік опинився прямо перед голкіпером,",
  ' але прошити його не зумів.\n' +
    'Зрештою, фінальний свисток зафіксував перемогу Вільяреала з рахунком 2:1. Матч-відповідь пройде на Емірейтс вже за тиждень.\n' +
    'У першому півфіналі Вільяреал виглядав блискуче. Особливо яскраво "жовта субмарина" виглядала до перерви: "канонірам" не дозволили провести жодної атаки з вриванням у штрафний, а у перші півгодини рахунок міг стати розгромним – і все це стало наслідком тактичної переваги над лондонцями. У статистиці вона залишилась непомітною, але організаційно левантійці виглядали',
  ' значно краще.\n' +
    '\n' +
    'Перш за все, варто відзначити правильну оцінку недоліків Арсенала. Основна його сила криється на флангах, але вінгери слабко виконують чорнову та позиційну роботу. На лівому фланзі лондонці були особливо вразливими, адже там не було профільного фулбека – Джака, попри отриманий при Емері досвід гри на позиції лівого захисника, не міг повноцінно замінити Тірні. Як наслідок, за спинами Сака і Пепе виникали розриви, через які Вільяреал виходив у атаку й забивав голи.\n' +
    "Так, перший забитий м'яч розпочався з помилки Пепе при командному пресингу. Спочатку всі дисципліновано грали з іспанцями один-в-один, але передача назад на голкіпера розбила тиск гостей – Сміт-Роу кинув Альбіоля й атакував Рульї, а Пепе розірвався між завданнями. У підсумку Ніколя і до Альбіоля не дійшов, і швидкого Фойта залишив за спиною. Парехо ж, отримавши пас під тиском опорників, всього одним переведенням відрізав половину Арсенала, запустивши Фойта в прохід правим флангом. Далі Хуан віддасть пас на Чуквуезе, після чого",
  ' станеться гол.\n' +
    '\n' +
    'Картинка клікабельна\n' +
    'Ця проблема була систематичною. За дві хвилини до взяття воріт Пепе також покинув Фойта – так, він правильно грав, намагаючись не дати свободу центрбекам при розіграші, але підтримки від Джака чи когось із партнерів Ніколя не отримав. Аналогічним чином Вільяреал організує атаку наприкінці першого тайму, коли Морено виходив віч-на-віч.\n' +
    '\n' +
    'Картинка клікабельна\n' +
    'Подібні ситуації виникали регулярно. Всього одна-дві передачі взад-поперек відкривали партнера по команді на фланзі чи в центрі поля – пресинг Арсенала виявився провальним. Наприклад, на 21-й хвилині грамотний тиск 3-в-3 всього за секунду завершився створенням варіанту передачі на Парехо. Пау Торрес затягнув з пасом, але Сака так довго наважувався на атаку центрбека, що той спокійно віддав на Педрасу.\n' +
    '\n' +
    'Картинка клікабельна\n' +
    'І знову свобода в центрі поля для всемогутнього Парехо через неправильне позиціювання Едегора. Арсенал у центрі поля взагалі виглядав інертно, чим і користувалися центрхави левантійців. Таким',
  ' чином, маємо поєднання структурного провалу при організації пресингу із індивідуальними помилками у ключових зонах.\n' +
    '\n' +
    'При цьому в обороні Вільяреал виглядав компактно й щільно, нічого не дозволяючи супернику. Команда Мікеля Артети була неготовою до такого футболу "жовтої субмарини", однак це ще півбіди. Виявилось, що лондонці і при стандартах не читали левантійців – інакше другого взяття воріт не сталось би. Гол Альбіоля став голом-близнюком голу Торреса на НСК Олімпійський – Морено виконував скидку на дальню стійку, а Рауль замкнув. Холдінг при цьому програв позиційну боротьбу Жерару. Це була награна класична комбінація.\n' +
    'Унаї Емері блискуче скористався вадами Арсенала. Господарі домінували й могли громити "канонірів" ще до перерви, однак після неї Вільяреал зупинився – і це була фатальна помилка. Лондонцям віддали ініціативу, а ті могли забити вже на 47-й хвилині після прострілу на Пепе. Так, його удар виявився єдиним моментом гостей на довгий час, а на 57-й хвилині англійці ще й у меншості залишились',
  ' – але Арсеналу дали повірити в себе. Виявилось, що з цим Вільяреалом цілком можна грати у свій футбол.\n' +
    '\n' +
    'Іспанці побігли добивати суперника у більшості, але поїзд вже поїхав. Реалізація підкачала, а після травми Фойта на 70-й хвилині Вільяреал втратив необхідну динаміку, дозволивши вінгерам "канонірів" агресивніше працювати у атаці. Ще до злощасного фолу на Сака у штрафний гостей пройшло кілька прострілів та вривань, тож епізод з пенальті не здивував. Фулбеки і в першому таймі діяли проти Сака і Пепе необережно, якщо тим вдавалося набрати швидкість – той же Фойт збивав Ніколя на 33-й хвилині (але іспанців врятувала рука француза).\n' +
    'Після вилучення Капу футбол Вільяреала взагалі розвалився, ледь не завершившись другим голом Арсенала. Так, все це виглядало б нелогічно, якщо взяти загальну картину зустрічі, але певна справедливість у цьому була – там, де МЮ пішов розривати інертну Рому, створюючи град моментів, Вільяреал перестраховувався. Навіть у першому таймі можна було зробити більше, ніж три моменти.\n' +
    '\n' +
    'Унаї',
  ' Емері перемудрив, вирішивши зіграти на контратаках одразу з початком другого тайму, навіть не перевіривши лондонців на міцність, а по ходу гри його Вільяреал не перебудувався. Вочевидь, саме тому баск нині і не працює у топ-клубі.\n' +
    'Арсенал провалив більшу частину матчу проти Вільяреала, але було б несправедливо не відзначити дві хороші риси у цьому колективі. Першою виступає характер – лондонці, попри тиск іспанців у перші 15 хвилин, зуміли вирівняти хід зустрічі й організувати кілька непоганих атак, а в другому таймі вони забрали старт і останні 20 хвилин. Звісно, ми б не говорили про характер, якби Лєно не виконав три сейви на 60-х хвилинах, але не можна сказати, що гості "поплили" у цей період – команда просто допустила серію помилок у захисті.\n' +
    '\n' +
    'Підопічні Мікеля Артети зуміли зібратись, забивши важливий гол ще у меншості, а під кінець зустрічі вони могли ще й нічию вирвати. Така сила волі викликає повагу – лондонці грубо помилялися, але тримали удар і шукали можливості відповісти. Той же гол Сака не стався',
  ' б, якби Букайо в черговий раз не пішов у дриблінг проти кількох суперників на краю штрафного – 19-річного англійця разом з усією командою відвозили, але він не втратив впевненості у своїх силах.\n' +
    'Це також говорить про певний запас міцності у Арсенала на даному рівні. У команди може багато не виходити, однак у будь-який момент лідери здатні увімкнути клас, вирішивши долю матчу. Показовим став момент на 90+3-й хвилині, коли гості провели атаку з геніальним розрізним пасом Парті та відкриванням Обамеянга, ледь не зрівнявши рахунок. І це на тлі загальної переваги іспанців в активності. По суті, Арсенал міг зіграти з рахунком 2:2, реалізувавши всього один дійсно гострий підхід до воріт із ударним завершенням.\n' +
    'Статистично клас Арсенала також помітний. Так, підопічні Мікеля Артети провалили зустріч в організаційному плані, ледь не зазнавши розгрому, але по цифрах у команд все більш-менш рівно – 9:9 за ударами (7:7 з меж штрафного), 10:8 за передачами в карний майданчик, 29:25 за дотиками у ньому, 0,91 vs 1,23',
  ' за гостротою пасів, 83% vs 84% за точністю пасів. Гості навіть більше працювали на чужій половині й перевершили суперника у володінні (55%), хоча грали у меншості. За інтенсивністю пресингу Арсенал теж був кращим, не дозволяючи іспанцям зробити більше 8,6 передач у 40 метрах від чужих воріт (у Вільяреала цей показник становить 9,1)\n' +
    '\n' +
    `Звісно, ці цифри також говорят про стерильність володіння та слабке завершення атак (всього 0,33 xG), але в цілому ситуація виглядає тривожно для Вільяреала. Навіть у матчі проти ослабленого складу "канонірів", граючи 20 хвилин у більшості й створивши мінімум шість гольових моментів, іспанці не перевершили Арсенал за якістю дистрибуції та контролю м'яча. Вдома ж англійці будуть агресивнішими й вийдуть у значно сильнішому складі.\n` +
    "Це твердження виглядає суперечливо після важкого виїзного поєдинку, але за нього виступає дуже багато факторів. По-перше, здивували слова Унаї Емері у флеш-інтерв'ю BT Sport – баск заявив, що у гостях Вільяреал буде діяти за тим же планом, намагаючись",
  ' контролювати матч. Арсенал навіть у першому таймі вирівнював хід гри, а в останні 20 хвилин футбол іспанців взагалі розвалився. Статистично "каноніри" також не програвали, а під кінець матчу вони мали шанс зрівняти рахунок – після такого очевидною стає необхідність корегування плану левантійців на матч-відповідь.\n' +
    '\n' +
    'Вільяреалу важко буде зіграти так само вже хоча б через ймовірне повернення Тірні на лівий фланг оборони та вихід Обамеянга на вістрі атаки. В таких умовах і розкривати зони за спиною Пепе буде важче, і йти вперед великими силами стане небезпеченіше. У Іспанії було помітно, як же сильно Арсеналу не вистачає фінішера екстра-класу – коли він вийшов, гості створили свій найкращий момент у зустрічі. Через тиждень цей фінішер буде в строю.\n' +
    'Зрештою, викликає запитання здатність Вільяреала тримати рахунок. На початку другого тайму "жовта субмарина" віддала ініціативу – і нічого хорошого з цього не вийшло. В обороні команди Унаї Емері виділяється тільки Пау Торрес, в той час як фулбеки та 35-річний',
  ' Альбіоль є вразливими до ривків за спину та роботи один-в-один. Вільяреал дійсно більше заточений на контроль та позиційні атаки, але агресивна гра на виїзді може дорого коштувати іспанцям.\n' +
    '\n' +
    'Очевидно, що "жовтій субмарині" не варто було пропускати той дурний пенальті. Без нього розклад виглядав ідеально для Вільяреала, а тепер все в руках Арсенала – необхідно тільки забити перший гол. Звісно, суперники рівні, а серія пенальті здається цілком вірогідною, однак левантійцям точно вже не вдасться отримати таку перевагу, яку вони мали вдома. Тепер їм буде реально важко.\n' +
    '<a href="https://football24.ua/vilyarreal_arsenal_oglyad_matchu_29_04_2021_liga_yevropi_n660699/">Football24.ua</a>'
] }];


routFun();

async function routFun() {
  const arrRes = arr;
  for (let j = 0; j < arrRes.length; j++) {
    const item = arrRes[j];
    if (typeof item.caption === 'string') {
      await sayPhotoKeyboard(chatIdChanelModer2, item.immage, { caption: item.caption });
    } else {
      let j = 0;
      let capt = '';
      for (let i = 0; i < item.caption.length; i++) {
        if (i === 0) {
          await sayPhotoKeyboard(chatIdChanelModer2, item.immage, { caption: item.caption[0] });
        } else {
          capt = capt.concat(item.caption[i]);
          if (i === item.caption.length - 1) {
            await sayMessageKeyboard(chatIdChanelModer2, capt);
          }
          j++;
          if (j === 4) {
            await sayMessageKeyboard(chatIdChanelModer2, capt);
            j = 0;
            capt = '';
          }
        }
      }
    }
  }
  return bufer;
}

async function sayPhotoDefault(chatIdSay, urlPhoto, options) {
  if (options === undefined) {
    options = {};
  } else {
    options = {
      caption: options.caption,
      'parse_mode': 'HTML'
    };
  }
  await botTelegram.sendPhoto(chatIdSay, urlPhoto, options);
}

async function sayPhotoKeyboard(chatIdSay, urlPhoto, options) {
  options = {
    caption: options.caption,
    'parse_mode': 'HTML',
    'disable_web_page_preview': true,
    'reply_markup': {
      'inline_keyboard': [
        [
          {
            text: 'Утвердить статью',
            'callback_data': 'Утверждение статьи'
          }
        ]
      ]
    }
  };
  await botTelegram.sendPhoto(chatIdSay, urlPhoto, options);
}

async function sayMessageDefault(chatIdSay, messageSay) {
  const options = {
    'disable_web_page_preview': true,
    'parse_mode': 'HTML'
  };
  await botTelegram.sendMessage(chatIdSay, messageSay, options);
}

async function sayMessageKeyboard(chatIdSay, messageSay) {
  const optionsNew = {
    'disable_web_page_preview': true,
    'parse_mode': 'HTML',
    'reply_markup': {
      'inline_keyboard': [
        [
          {
            text: 'Утвердить статью',
            'callback_data': 'Утверждение статьи'
          }
        ]
      ]
    }
  };
  await botTelegram.sendMessage(chatIdSay, messageSay, optionsNew);
}


botTelegram.on('callback_query', async (msg) => {
  const textArticle   = msg.message.text;
  if (textArticle !== undefined) {
    if (msg.message.entities !== undefined) {
      const textArticle     = msg.message.text;
      const articlesParts   = textArticle.split('\n');
      const nameResourse    = articlesParts.pop(); //последний элемент массива
      const zagolovok       = articlesParts.join('\n');
      const linkArticle     = msg.message.entities[msg.message.entities.length - 1].url;
      const captionArticle  = zagolovok.concat(`\n<a href="${linkArticle}">${nameResourse}</a>`);
      await sayPhotoDefault(chatIdChanelNews, linkArticle);
      await sayMessageDefault(chatIdChanelNews, `${captionArticle}`);
    } else {
      await sayMessageDefault(chatIdChanelNews, textArticle);
    }
  } else {
    let captionArticle  = msg.message.caption;
    const articlesParts = captionArticle.split('\n');
    const nameResourse  = articlesParts.pop(); //последний элемент массива
    const zagolovok     = articlesParts.join('\n');
    const linkArticle     = msg.message.caption_entities[msg.message.caption_entities.length - 1].url;
    captionArticle      = zagolovok.concat(`\n<a href="${linkArticle}">${nameResourse}</a>`);
    const linkPhoto       = msg.message.photo[msg.message.photo.length - 1].file_id;
    await sayPhotoDefault(chatIdChanelNews, linkPhoto, { caption: captionArticle });
  }
});
