'use strict';

const splitCaption = require('../lib/splitCaption.js');
const str = 'Лікар першої команди Шахтаря Вадим Попов поділився невтішними новинами щодо травм Жуніора Мораєса та Валерія Бондаря.\n' +
    `"Жуніор минулого тижня отримав дуже серйозну травму – розрив бокової та хрестоподібної зв'язок коліна. Це одна з найскладніших травм, що є у футболі, вона передбачає тривалий період післяопераційної реабілітації – дев’ять місяців, щоб повернути гравця до строю. Мораєс у супроводі Артура Глущенка полетів до Іспанії, де в одній з місцевих клінік Жуніору було зроблено операцію. Після повернення до України на футболіста чекає період відновлення.\n` +
    "Бондар? Багато хто, напевне, бачив те страшне зіткнення, коли нога просто пішла в бік... Було дуже схоже, що у Валерія така сама травма, як і в Жуніора, проте, на щастя, МРТ це не підтвердила. Хрестоподібна зв'язка в нього ціла, однак є ушкодження медіальної бокової зв'язки колінного суглоба. Стався субтотальний розрив. Ця травма також досить неприємна, але період відновлення коротший – місяці три.\n" +
    'Найголовніше, що Валерію наразі не потрібне хірургічне' +
  ` втручання. Намагатимемось обійтися тільки терапевтичними засобами: реабілітація, фізіотерапія, введемо фактор росту, і зв'язка повинна загоїтись. Трохи згодом проведемо додаткове обстеження, й тоді остаточно буде ухвалено рішення щодо тактики лікування. Але все одно спортсмен залишиться без футболу на два-три місяці", – цитує Попова офіційний сайт Шахтаря з посиланням на Shakhtar TV.\n` +
    'До слова, отримані травми унеможливлюють участь і Жуніора Мораєса, і Валерія Бондаря у груповому етапі Євро-2020 цього літа.\n' +
    '<a href="https://football24.ua/shahtar_ogolosiv_termini_vidnovlennya_morayesa_ta_bondarya__forvard_vzhe_ne_zigraye_v_2021_mu_oborontsyu_poshhastilo_bilshe_n660936/">Football24.ua</a>';

(async () => {
  const vvv = await splitCaption(str);
  console.log('8. vvv -> ', vvv);
})();

const ttt = '<a href="https://football24.ua/pszh__manchester_siti_gvardiola_rozkriv_sekret_uspihu_mistyan_u_drugomu_taymi__doluchivsya_zinchenko_n660973/">Football24.ua</a';

console.log(ttt.length);
